zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_def.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_def.h
  * @author  MCD Application Team
  * @brief   This file contains HAL common defines, enumeration, macros and
  *          structures definitions.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_DEF
#define STM32MP2xx_HAL_DEF

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#if defined (__ARM_FEATURE_CMSE) &&  (__ARM_FEATURE_CMSE == 3U)
#include <arm_cmse.h>
#endif /* __ARM_FEATURE_CMSE */
#include <stddef.h>
#include "stm32mp2xx.h"
#if defined(USE_HAL_LEGACY)
#include "Legacy/stm32_hal_legacy.h"
#endif /* USE_HAL_LEGACY */

/* Exported types ------------------------------------------------------------*/

/**
  * @brief  HAL Status structures definition
  */
typedef enum
{
  HAL_OK       = 0x00U,
  HAL_ERROR    = 0x01U,
  HAL_BUSY     = 0x02U,
  HAL_TIMEOUT  = 0x03U
} HAL_StatusTypeDef;

/**
  * @brief  HAL Lock structures definition
  */
typedef enum
{
  HAL_UNLOCKED = 0x00U,
  HAL_LOCKED   = 0x01U
} HAL_LockTypeDef;

/* Exported macros -----------------------------------------------------------*/

#define HAL_MAX_DELAY      0xFFFFFFFFU

#define HAL_IS_BIT_SET(REG, BIT_MASK)         (((REG) & (BIT_MASK)) != (uint32_t)RESET)
#define HAL_IS_BIT_CLR(REG, BIT_MASK)         (((REG) & (BIT_MASK)) == (uint32_t)RESET)

#define __HAL_LINKDMA(__HANDLE__, __PPP_DMA_FIELD__, __DMA_HANDLE__)               \
  do{                                                        \
    (__HANDLE__)->__PPP_DMA_FIELD__ = &(__DMA_HANDLE__); \
    (__DMA_HANDLE__).Parent = (__HANDLE__);              \
  } while (0U)

#if !defined(UNUSED)
#define UNUSED(x) ((void)(x)) /* To avoid gcc/g++ warnings */
#endif /* UNUSED */

/** @brief Reset the Handle's State field.
  * @param __HANDLE__: specifies the Peripheral Handle.
  * @note  This macro can be used for the following purpose:
  *          - When the Handle is declared as local variable; before passing it as parameter
  *            to HAL_PPP_Init() for the first time, it is mandatory to use this macro
  *            to set to 0 the Handle's "State" field.
  *            Otherwise, "State" field may have any random value and the first time the function
  *            HAL_PPP_Init() is called, the low level hardware initialization will be missed
  *            (i.e. HAL_PPP_MspInit() will not be executed).
  *          - When there is a need to reconfigure the low level hardware: instead of calling
  *            HAL_PPP_DeInit() then HAL_PPP_Init(), user can make a call to this macro then HAL_PPP_Init().
  *            In this later function, when the Handle's "State" field is set to 0, it will execute the function
  *            HAL_PPP_MspInit() which will reconfigure the low level hardware.
  * @retval None
  */
#define __HAL_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = 0U)

#if (USE_RTOS == 1)
#error " USE_RTOS should be 0 in the current HAL release "
#else
#define __HAL_LOCK(__HANDLE__)                                           \
  do{                                        \
    if((__HANDLE__)->Lock == HAL_LOCKED)   \
    {                                      \
      return HAL_BUSY;                    \
    }                                      \
    else                                   \
    {                                      \
      (__HANDLE__)->Lock = HAL_LOCKED;    \
    }                                      \
  } while (0U)

#define __HAL_UNLOCK(__HANDLE__)                                          \
  do{                                       \
    (__HANDLE__)->Lock = HAL_UNLOCKED;    \
  } while (0U)
#endif /* USE_RTOS */

#if defined (__GNUC__) && !defined (__CC_ARM)
#ifndef __weak
#define __weak   __attribute__((weak))
#endif /* __weak */
#ifndef __packed
#define __packed __attribute__((__packed__))
#endif /* __packed */
#endif /* __GNUC__ */

/* Macro to get variable aligned on 4-bytes */
#if defined(__ICCARM__)                         /*!< IAR Compiler */
#ifndef __ALIGN_BEGIN
#define __ALIGN_BEGIN    _Pragma("data_alignment=4")
#endif /* __ALIGN_BEGIN */
#ifndef __ALIGN_END
#define __ALIGN_END
#endif /* __ALIGN_END */
#elif defined(__GNUC__) && !defined (__CC_ARM)  /*!< GNU Compiler */
#ifndef __ALIGN_BEGIN
#define __ALIGN_BEGIN
#endif /* __ALIGN_BEGIN */
#ifndef __ALIGN_END
#define __ALIGN_END      __attribute__ ((aligned (4)))
#endif /* __ALIGN_END */
#elif defined(__CC_ARM)                         /*!< ARM Compiler */
#ifndef __ALIGN_BEGIN
#define __ALIGN_BEGIN    __align(4)
#endif /* __ALIGN_BEGIN */
#ifndef __ALIGN_END
#define __ALIGN_END
#endif /* __ALIGN_END */
#elif defined (__TASKING__)                     /*!< TASKING Compiler */
#ifndef __ALIGN_BEGIN
#define __ALIGN_BEGIN    __align(4)
#endif /* __ALIGN_BEGIN */
#ifndef __ALIGN_END
#define __ALIGN_END
#endif /* __ALIGN_END */
#endif /* Compiler selection */

/* Macro to get variable aligned on 8-bytes */
#if defined(__ICCARM__)                         /*!< IAR Compiler */
#ifndef __ALIGN_8_BEGIN
#define __ALIGN_8_BEGIN  _Pragma("data_alignment=8")
#endif /* __ALIGN_8_BEGIN */
#ifndef __ALIGN_8_END
#define __ALIGN_8_END
#endif /* __ALIGN_8_END */
#elif defined(__GNUC__) && !defined (__CC_ARM)  /*!< GNU Compiler */
#ifndef __ALIGN_8_BEGIN
#define __ALIGN_8_BEGIN
#endif /* __ALIGN_8_BEGIN */
#ifndef __ALIGN_8_END
#define __ALIGN_8_END    __attribute__ ((aligned (8)))
#endif /* __ALIGN_8_END */
#elif defined(__CC_ARM)                         /*!< ARM Compiler */
#ifndef __ALIGN_8_BEGIN
#define __ALIGN_8_BEGIN  __align(8)
#endif /* __ALIGN_8_BEGIN */
#ifndef __ALIGN_8_END
#define __ALIGN_8_END
#endif /* __ALIGN_8_END */
#elif defined (__TASKING__)                     /*!< TASKING Compiler */
#ifndef __ALIGN_8_BEGIN
#define __ALIGN_8_BEGIN  __align(8)
#endif /* __ALIGN_8_BEGIN */
#ifndef __ALIGN_8_END
#define __ALIGN_8_END
#endif /* __ALIGN_8_END */
#endif /* Compiler selection */

/* Macro to get variable aligned on 32-bytes,needed for cache maintenance purpose */
#if defined   (__GNUC__)
/* GNU Compiler */
#define ALIGN_32BYTES(buf)  buf __attribute__ ((aligned (32)))
#elif defined (__ICCARM__)
/* IAR Compiler */
#define ALIGN_32BYTES(buf) _Pragma("data_alignment=32") buf
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#define ALIGN_32BYTES(buf) __ALIGNED(32) buf
#elif defined   (__CC_ARM)
/* ARM Compiler */
#define ALIGN_32BYTES(buf) __align(32) buf
#endif /* __GNUC__ */

/**
  * @brief  __RAM_FUNC definition
  */
#if defined (__CC_ARM)
/* ARM Compiler
   ------------
   RAM functions are defined using the toolchain options.
   Functions that are executed in RAM should reside in a separate source module.
   Using the 'Options for File' dialog you can simply change the 'Code / Const'
   area of a module to a memory space in physical RAM.
   Available memory areas are declared in the 'Target' tab of the 'Options for Target'
   dialog.
*/
#define __RAM_FUNC

#elif defined (__ICCARM__)
/* ICCARM Compiler
   ---------------
   RAM functions are defined using a specific toolchain keyword "__ramfunc".
*/
#define __RAM_FUNC __ramfunc

#elif defined (__GNUC__)
/* GNU Compiler
   ------------
  RAM functions are defined using a specific toolchain attribute
   "__attribute__((section(".RamFunc")))".
*/
#define __RAM_FUNC __attribute__((section(".RamFunc")))

#endif /* __CC_ARM */

/**
  * @brief  __NOINLINE definition
  */
#if defined (__CC_ARM) || defined (__GNUC__)
/* ARM & GNUCompiler
   ----------------
*/
#define __NOINLINE __attribute__ ( (noinline) )

#elif defined (__ICCARM__)
/* ICCARM Compiler
   ---------------
*/
#define __NOINLINE _Pragma("optimize = no_inline")

#endif /* __CC_ARM | __GNUC__ */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_DEF */
